import {Component, OnDestroy, OnInit} from '@angular/core';
import {ActivatedRoute, Params, Router} from '@angular/router';
import {Subscription} from 'rxjs';
import {map, pluck} from 'rxjs/operators';


interface IBulletinRecord {
  num: number;
  name: string;
  description: string;
}

const data: Array<IBulletinRecord> = [
  {num: 1, name: 'БУГАКОВ ЯРОСЛАВ СЕРГІЙОВИЧ', description: 'народився 26 квiтня 1989 року в місті Дебальцеве Донецької області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, тимчасово не працює, безпартійний, проживає в місті Дебальцеве Донецької області, судимість відсутня, самовисування.'},
  {num: 2, name: 'ГОЛОБОРОДЬКО ПАВЛО ВІТАЛІЙОВИЧ', description: 'народився 11 липня 1990 року в місті Васильків Київської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, начальник відділу фінансового аналізу та аудиту, ПрАТ "СК "ЮНІВЕС", безпартійний, проживає в місті Васильків Київської області, судимість відсутня, самовисування.'},
  {num: 3, name: 'ДУБИНСЬКИЙ ВАДИМ ВОЛОДИМИРОВИЧ', description: 'народився 12 грудня 1971 року в місті Сміла Черкаської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, керівник підрозділу, "ПП "Слуга народу", безпартійний, проживає в місті Сміла Черкаської області, судимість відсутня, самовисування.'},
  {num: 4, name: 'ДУБИНСЬКИЙ МАКСИМ МИКОЛАЙОВИЧ', description: 'народився 28 квiтня 1998 року в місті Умань Черкаської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта загальна середня, керівник проекту, "ПП "Слуга народу", безпартійний, проживає в місті Сміла Черкаської області, судимість відсутня, самовисування.'},
  {num: 5, name: 'ДУБІНСЬКИЙ ОЛЕКСАНДР АНАТОЛІЙОВИЧ', description: 'народився 18 квiтня 1981 року в місті Києві, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, телеведучий, ІП "1+1 Продакшн", безпартійний, проживає в місті Києві, судимість відсутня, суб’єкт висування – ПОЛІТИЧНА ПАРТІЯ "СЛУГА НАРОДУ". '},
  {num: 6, name: 'КОНОНЕНКО ІГОР ВІТАЛІЙОВИЧ', description: 'народився 21 серпня 1965 року в місті Києві, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, народний депутат України, безпартійний, проживає в місті Києві, судимість відсутня, самовисування.'},
  {num: 7, name: 'КОНОНЕНКО ОЛЕКСІЙ ФЕДОРОВИЧ', description: 'народився 1 травня 1983 року в місті Києві, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, керівник інформаційно-технічного відділу, ТОВ "Солідарність плюс", безпартійний, проживає в місті Києві, судимість відсутня, самовисування.'},
  {num: 8, name: 'ПІДГУРСЬКИЙ МИКОЛА МИКОЛАЙОВИЧ', description: 'народився 27 червня 1982 року в місті Васильків Київської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта професійно-технічна, тимчасово не працює, член ПОЛІТИЧНОЇ ПАРТІЇ "СЛУГА НАРОДУ", проживає в селі Ольшаниця Рокитнянського району Київської області, судимість відсутня, самовисування.'},
  {num: 9, name: 'КУКСІН ЄВГЕНІЙ ВІКТОРОВИЧ', description: 'народився 29 липня 1994 року в місті Вишневе Києво-Святошинського району Київської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта загальна середня, кореспондент управління журналістських проектів, Департамент журналістських проектів ІП "1+1 Продакшн", безпартійний, проживає в місті Вишневе Києво-Святошинського району Київської області, судимість відсутня, самовисування.'},
  {num: 10, name: 'НОВОСЕЛЬЦЕВ ЖАН ВАДИМОВИЧ', description: 'народився 17 червня 1980 року в місті Харкові, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, комунікаційний директор, громадська організація "СЛУГА НАРОДУ", безпартійний, проживає в місті Харкові, судимість відсутня, самовисування.'},
  {num: 11, name: 'САБАЩУК ЮРІЙ МИКОЛАЙОВИЧ', description: 'народився 7 травня 1975 року в місті Києві, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, менеджер, громадська організація "ПП "СЛУГА НАРОДУ", безпартійний, проживає в місті Києві, судимість відсутня, самовисування.'}
];

  @Component({
  selector: 'app-bulletin1',
  templateUrl: './bulletin1.component.html',
  styleUrls: ['./bulletin1.component.css']
})
export class Bulletin1Component implements OnInit {
  private answerReady = false;
  private id: string;
  public data = data.slice();
  constructor(private router: Router, private route: ActivatedRoute) { }

  ngOnInit() {
  }


  setAnswer(e): void {
    this.answerReady = true;
    localStorage.setItem(`${this.id}_answer1`, e);
  }

  gotoNext(): void {
   this.router.navigate(['bul2'], {queryParams: {...this.route.snapshot.queryParams}});
   window.scroll(0, 0);
  }

}
