import { Component, OnInit } from '@angular/core';
import {Router} from '@angular/router';

interface IBulletinRecord {
  num: number;
  name: string;
  description: string;
}

const data: Array<IBulletinRecord> = [
  {num: 1, name: 'АЛЕКСІЄНКО ТЕТЯНА ВАЛЕНТИНІВНА', description: 'народилася 20 липня 1998 року в місті Кременчук Полтавської області, громадянка України, протягом останніх п’яти років проживає на території України, освіта загальна середня, директор, приватне підприємство "СЛУГА-НАРОДА", безпартійнa, проживає в селі Кривуші Кременчуцького району Полтавської області, судимість відсутня, самовисування.'},
  {num: 2, name: 'ГАМЗА СЕРГІЙ ІВАНОВИЧ', description: 'народився 31 сiчня 1954 року в місті Хабаровськ, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, директор, приватне підприємство "ОПОЗИЦІЙНИЙ БЛОК!", член ПОЛІТИЧНОЇ ПАРТІЇ "ОПОЗИЦІЙНА ПЛАТФОРМА – ЗА ЖИТТЯ", проживає в місті Кременчук, судимість відсутня, самовисування.'},
  {num: 3, name: 'ДЕДЮРІН ВІТАЛІЙ МИКОЛАЙОВИЧ', description: 'народився 20 жовтня 1968 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, директор, приватне підприємство "СЛУГА НАРОДА", безпартійний, проживає в місті Кременчук Полтавської області, судимість відсутня, самовисування.'},
  {num: 4, name: 'ДРОЗДОВА ІРИНА ВІКТОРІВНА', description: 'народилася 31 жовтня 1960 року в місті Кременчук Полтавської області, громадянка України, протягом останніх п’яти років проживає на території України, освіта професійно-технічна, директор, приватне підприємство "ЗЕ! СЛУГА НАРОДУ!", безпартійнa, проживає в місті Кременчук Полтавської області, судимість відсутня, самовисування.'},
  {num: 5, name: 'КУЗЬМІН КИРИЛО ВОЛОДИМИРОВИЧ', description: 'народився 24 травня 1992 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта загальна середня, директор, приватне підприємство "СЛУГА НАРОДА!", безпартійний, проживає в місті Полтаві, судимість відсутня, самовисування.'},
  {num: 6, name: 'МЕДВЕДЕНКО ОЛЕГ ВОЛОДИМИРОВИЧ', description: 'народився 17 вересня 1983 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, директор, КЗ фізичної культури і спорту "Кременчуцький міський центр фізичного здоров’я населення "Спорт для всіх", безпартійний, проживає в селі Садки Кременчуцького району Полтавської області, судимість відсутня, суб’єкт висування – партія "ОПОЗИЦІЙНИЙ БЛОК".'},
  {num: 7, name: 'ПЕРЕПЕЛЯТНИК СЕРГІЙ ЛЕОНІДОВИЧ', description: 'народився 1 жовтня 1973 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, директор, КП "Кременчуцька міська телерадіокомпанія", член ПОЛІТИЧНОЇ ПАРТІЇ "СИЛА І ЧЕСТЬ", проживає в місті Кременчук Полтавської області, судимість відсутня, суб’єкт висування – ПОЛІТИЧНА ПАРТІЯ "СИЛА І ЧЕСТЬ".\n'},
  {num: 8, name: 'САВЧЕНКО ОЛЕГ ВІТАЛІЙОВИЧ', description: 'народився 16 квiтня 1971 року в селі Луценки Лохвицького району Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, директор, приватне підприємство "ГОЛОС!", безпартійний, проживає в місті Кременчук Полтавської області, судимість відсутня, самовисування.'},
  {num: 9, name: 'СІДЕРКА ТЕТЯНА АНАТОЛІЇВНА', description: 'народилася 8 вересня 1971 року в місті Кременчук Полтавської області, громадянка України, протягом останніх п’яти років проживає на території України, освіта середня спеціальна, директор, ПП "Самталі", безпартійнa, проживає в місті Кременчук Полтавської області, судимість відсутня, самовисування.'},
  {num: 10, name: 'УРІН ФЕЛІКС ОЛЕКСАНДРОВИЧ', description: 'народився 7 квiтня 1984 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, адвокат, член ПОЛІТИЧНОЇ ПАРТІЇ "СЛУГА НАРОДУ", проживає в місті Кременчук Полтавської області, судимість відсутня, суб’єкт висування – ПОЛІТИЧНА ПАРТІЯ "СЛУГА НАРОДУ".'},
  {num: 11, name: 'ШАПОВАЛОВ ЮРІЙ АНАТОЛІЙОВИЧ', description: 'народився 14 березня 1972 року в місті Кременчук Полтавської області, громадянин України, протягом останніх п’яти років проживає на території України, освіта вища, народний депутат України, безпартійний, проживає в місті Кременчук Полтавської області, судимість відсутня, самовисування.'},
];

@Component({
  selector: 'app-bulletin2',
  templateUrl: './bulletin2.component.html',
  styleUrls: ['./bulletin2.component.css']
})
export class Bulletin2Component implements OnInit {
  private answerReady = false;
  public data = data.slice();
  constructor(private router: Router) { }

  ngOnInit() {
  }

  setAnswer(e): void {
    this.answerReady = false;
  }

  gotoNext(): void {
    this.router.navigate(['end']);
    window.scroll(0, 0);
  }

}
